## Pandas Tutorial

In [1]:
import pandas as pd
import numpy as np

In [8]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),
                  index=['Row1','Row2','Row3',
                         'Row4','Row5'],
                 columns=['Column1','Column2',
                        'Column3','Column4'])

In [9]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [10]:
df.to_csv('./Test1.csv')

In [11]:
# Accessing Elements
## 1. .loc 1. .iloc

df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [12]:
type(df.loc['Row1'])

pandas.core.series.Series

In [13]:
df.iloc[:,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [14]:
df.iloc[0:2,0:2]

      Column1  Column2
Row1        0        1
Row2        4        5

In [15]:
type(df.iloc[0:2,0:2])

pandas.core.frame.DataFrame

In [21]:
df.iloc[:,0:1]

      Column1
Row1        0
Row2        4
Row3        8
Row4       12
Row5       16

In [22]:
type(df.iloc[:,0:1])

pandas.core.frame.DataFrame

In [25]:
df.iloc[:,0]

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: Column1, dtype: int32

In [26]:
df.iloc[:,1]

Row1     1
Row2     5
Row3     9
Row4    13
Row5    17
Name: Column2, dtype: int32

In [31]:
type(df.iloc[:,1])

pandas.core.series.Series

In [27]:
df.iloc[0,:]

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [28]:
df.iloc[1,:]

Column1    4
Column2    5
Column3    6
Column4    7
Name: Row2, dtype: int32

In [32]:
type(df.iloc[1,:])

pandas.core.series.Series

In [34]:
type(df.iloc[0:1,:])

pandas.core.frame.DataFrame

In [35]:
df.iloc[:,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [36]:
df.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [37]:
df.iloc[:,:].values.shape

(5, 4)

In [38]:
df.isnull()

      Column1  Column2  Column3  Column4
Row1    False    False    False    False
Row2    False    False    False    False
Row3    False    False    False    False
Row4    False    False    False    False
Row5    False    False    False    False

In [39]:
df.isna()

      Column1  Column2  Column3  Column4
Row1    False    False    False    False
Row2    False    False    False    False
Row3    False    False    False    False
Row4    False    False    False    False
Row5    False    False    False    False

In [40]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [41]:
df.isna().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [42]:
df['Column1']

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: Column1, dtype: int32

In [44]:
df.Column1

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: Column1, dtype: int32

In [45]:
df.Column1.value_counts()

0     1
4     1
8     1
12    1
16    1
Name: Column1, dtype: int64

In [46]:
df.Column1.unique()

array([ 0,  4,  8, 12, 16])

In [47]:
df['Column3']

Row1     2
Row2     6
Row3    10
Row4    14
Row5    18
Name: Column3, dtype: int32

In [48]:
df.Column3

Row1     2
Row2     6
Row3    10
Row4    14
Row5    18
Name: Column3, dtype: int32

In [49]:
type(df.Column3)

pandas.core.series.Series

In [50]:
type(df['Column3'])

pandas.core.series.Series

In [51]:
df['Column1']

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: Column1, dtype: int32

In [52]:
df[['Column1','Column3']]

      Column1  Column3
Row1        0        2
Row2        4        6
Row3        8       10
Row4       12       14
Row5       16       18